In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [25, 30, 35, 40, 45],
    "City": ["Berlin", "Munich", "Hamburg", "Berlin", "Munich"],
    "Salary": [50000, 60000, 75000, 80000, 90000]
})

In [3]:
print(df)

      Name  Age     City  Salary
0    Alice   25   Berlin   50000
1      Bob   30   Munich   60000
2  Charlie   35  Hamburg   75000
3    David   40   Berlin   80000
4      Eva   45   Munich   90000

In [6]:
df.head(3)

      Name  Age     City  Salary
0    Alice   25   Berlin   50000
1      Bob   30   Munich   60000
2  Charlie   35  Hamburg   75000

In [7]:
df.columns.tolist()

['Name', 'Age', 'City', 'Salary']

In [11]:
df["Name"].tolist()

['Alice', 'Bob', 'Charlie', 'David', 'Eva']

In [14]:
df.iloc[2].tolist()

['Charlie', 35, 'Hamburg', 75000]

In [17]:
df[df["Age"]> 35]

    Name  Age    City  Salary
3  David   40  Berlin   80000
4    Eva   45  Munich   90000

In [19]:
df.sort_values(by=["Salary"])

      Name  Age     City  Salary
0    Alice   25   Berlin   50000
1      Bob   30   Munich   60000
2  Charlie   35  Hamburg   75000
3    David   40   Berlin   80000
4      Eva   45   Munich   90000

In [20]:
df["Tax"] = df["Salary"]*0.2

In [21]:
df.head(3)

      Name  Age     City  Salary      Tax
0    Alice   25   Berlin   50000  10000.0
1      Bob   30   Munich   60000  12000.0
2  Charlie   35  Hamburg   75000  15000.0

In [26]:
df.Age.max()

45

In [29]:
df["City"]

0     Berlin
1     Munich
2    Hamburg
3     Berlin
4     Munich
Name: City, dtype: object

In [30]:
df.groupby("City")["Salary"].mean()

City
Berlin     65000.0
Hamburg    75000.0
Munich     75000.0
Name: Salary, dtype: float64